[
{
    "author": "Lana N.",
    "rating": 5.0,
    "description": "The pandan matcha latte is tasty here! The Pandan flavor was not too powerful, which I prefer because I don't like it when there's too much or it tastes too artificial. Mini space, but everyone who had their drinks inside seemed cozy. Will return when I'm in the neighborhood!",
    "date": "2023-04-03"
},
{
    "author": "Helena W.",
    "rating": 4.0,
    "description": "Absolutely obsessed with this place! A very cozy place in East Village for pandan matcha, pandan lattes, and pastries. Everything was beautifully decorated, with cute seating by the window. I wanna come back here with a book on a rainy day.The pandan matcha (I've tried it both cold and warm) is lovely. You can definitely taste the pandan. Excited to try the latte next. My boyfriend enjoyed his cold brew as well. And we both loved our pastries (almond croissant and tomato, feta, spinach turnover). This will definitely be our new local neighborhood spot!",
    "date": "2023-04-18"
},
{
    "author": "Hannah H.",
    "rating": 3.0,
    "description": "Le Phin is a small Vietnamese coffee shop that offers both classic and signature drinks, as well as some pastries.We stopped by to grab a latte and a treat to go:+a Pandan Latte - prepared with espresso, milk, and the cafe's housemade pandan syrup; unfortunately, this just tasted like steamed milk and had hardly of the pandan taste; I wished it was stronger; it was served piping hot, though, as requested+a Bear Cookie - this was the main reason why I wanted to stop by, since this bear cookie looked so cute!  It was more of a madeleine, with the crisp exterior and a sponge cake-like that's more on the dense side interior; not too sweet, and a nice a treat with coffee/teaService was very kind and friendly.The cafe is very small, with only a bench and a few tables; I'm not sure if this is a place where you'd sit and do some work, but it is quiet and has a relaxing vibe to it.+Bear Cookie+avoid the lattes+kind service+limited seating inside",
    "date": "2023-04-13"
},
{
    "author": "Shirley H.",
    "rating": 3.0,
    "description": "My brother brought back an iced pandan matcha latte and eh, I think the drink wasn't that great. I tasted the pandan but the latte felt diluted and there was no creamy taste. Disappointing compared to all the positive reviews I still plan to check it out myself and try the other Vietnamese coffee drinks, hope it's better then!",
    "date": "2023-04-10"
},
{
    "author": "Holly L.",
    "rating": 5.0,
    "description": "Great drinks! I like the Tahini (Black Sesame) latte here. This time got earl grey latte...it's okay (3.5 stars/5 for it...it was good but not 5 stars, not sure if it's tea brand or the ratio of tea to milk or maybe almond milk they use doesn't go well with earl grey?). Tahini Latte def one of my favorites here. The girl in front of me got it too. They have a variety of pastries and croffles. Didn't try them so cannot comment on it. Baristas were nice even though they're busy. Very popular place. 3 group of friends can be in there at the same time. Tables are close so you can hear other people's conversations easily...it is a small cozy place afterall. Great place to come, chat and catch up over coffee. Don't come if you have homework or need quiet place to study or read. Drink + almond milk = $6.80 (as of March 2023, next year's pricing? Who knows with this inflation lol) enjoy it for this price while you can, definitely a place worth checking out hence 5 star review.",
    "date": "2023-03-18"
},
{
    "author": "Anushka M.",
    "rating": 5.0,
    "description": "Koré might be my new favorite coffee shop! I was trying to find coffee nearby at the last minute and came across Koré on yelp. I walked over not thinking much of it but walking in I saw they make fresh croffles (croissant waffle) and have a specialty tiramisu latte. I ordered a chocolate and strawberry croffle and the iced tiramisu latte. The croffles are freshly made, and you can definitely tell. They were seriously amazing. The whipped cream was delicious and topped with fresh strawberries and chocolate drizzle. The waffle was perfectly crunchy on the outside and soft on the inside. My tiramisu latte was also out of this world! The layering is beautiful and it genuinely tasted like tiramisu. The employee was really friendly and made my latte quickly. I seriously can't believe I found this place so late, I will be coming here way more often!!",
    "date": "2023-03-24"
},
{
    "author": "Hannah H.",
    "rating": 3.0,
    "description": "Koré Coffee is a small Korean coffee shop in Chinatown, and if you blink, you may miss the small whale signage that lets you know that you're at the right place ('koré' is 'whale' in Korean)!This place offers espresso drinks, coffee, and non-coffee beverages, as well as croffles and other pastries from Balthazar.We came here to try their Tahini Latte (black sesame) as well as their famous signature Tiramisu Latte, prepared with a mascarpone whipped cream top.  The Tahini Latte was actually not what we expected - it tasted a bit too diluted and watery, and we weren't fans.  The Tiramisu Latte was okay - no need to mix as when you drink it, the mascarpone whipped cream top blends in with the rest of the latte drink.Service was super friendly and kind, and there are only a handful of chairs inside.  The place is definitely small, so most seem to get their items to-go.I'd be interested in trying out their croffle next time.+look for the whale signage!+friendly service!+limited seating inside",
    "date": "2023-04-15"
},
{
    "author": "Shelley F.",
    "rating": 4.0,
    "description": "My friends and I were exploring the area and were in much need of some caffeine and a place to rest our tired legs. We stopped by Koré Coffee, which turned out to be a pretty popular spot!The Tiramisu Latte piqued my interest as tiramisu is one of my top favorite desserts. However, it was a pricey cup of coffee for sure (almost $10 with tip). It was a solid drink, but I've had a better Tiramisu Latte in a cafe near my hometown for cheaper. For start, I wish the coffee was a little stronger. I understand that the cocoa powder is a nod to the famous Italian dessert, but I thought that it added an unpleasant texture. Cocoa powder doesn't dissolve easily, so it did taste a little chalky. In traditional preparation of tiramisu, the cocoa powder has time to hydrate in the cream, whereas in latte form, it does not receive the same time treatment.While the coffee shop is small, there is some space if you want to get some work/studying done, or socialize with a small group of friends. However, there is no public restroom available, although the barista did recommend me where to find one nearby.",
    "date": "2023-03-29"
},
{
    "author": "Katey G.",
    "rating": 5.0,
    "description": "This is a beautiful little cafe where they meticulously make your coffee.When you walk by, it's easy to miss. It's a little shop with high ceilings and tons of gorgeous plants everywhere. The coffee station almost feels like an afterthought since all of your attention is going to the plants and the peaceful ambiance inside. I've only ordered their cold brew which I really like. They're large is actually very large and is a good value for $4. I've witnessed them making matcha lattes and other coffes and they are so detail oriented.. it makes me want to order something more involved next time!There's no where to sit, so this is strictly to go. I think it might be connected to a salon next door?",
    "date": "2023-04-23"
},
{
    "author": "Kelsey B.",
    "rating": 3.0,
    "description": "It breaks my heart to say this, but I found that the matcha here was on the weaker side. My hot matcha latte tasted more like milk than match, which does not make it a worthwhile visit for me. Excuse the pastry, this is the only picture I got of my drink!Regardless, this cafe is truly beautiful. The vibe is great (though I don't believe they have any seating) and the staff is friendly. I was the only person in, so had relatively no wait time. I had heard great reviews of their matcha for so long, so I was pretty disappointed when it didn't stick out at all. They do seem to prepare it very fresh which is great, there's nothing worse than pre-made matcha syrup! I just think the measurements may have been off for my drink. I won't discourage anyone from going, but I wouldn't go out of my way to visit.",
    "date": "2023-04-01"
},
{
    "author": "Daniel A.",
    "rating": 5.0,
    "description": "A very nice espresso/coffee shop in Williamsburg.When you walk in, right away you notice the greenery and plants that engulf the entire coffee shop. These plants and greenery provide a cozy and warm vibe when you're there. I ordered the cappuccino with oat milk which was very good. The quality of the espresso beans was very rich & strong! The baristas here are very good at what they do & made our latte's and cappuccinos perfectly with the right amount of milk foam on top.",
    "date": "2023-02-22"
},
{
    "author": "Caroline D.",
    "rating": 5.0,
    "description": "One of the cutest coffee shops in the neighborhood! It's tiny & doesn't really offer seating, but it's definitely a great place to stop by for a grab & go coffee and snack. Their coffee is really good and pretty strong, and they also offer a small tea collection.",
    "date": "2023-04-23"
},
{
    "author": "Andrew L.",
    "rating": 5.0,
    "description": "Usagi NY is a cute little Japanese cafe with a little art gallery in the front and small tea and poke shop in the back. They have many authentic Japanese teas, drinks, and snacks available for purchase and have a comfy sitting area for you to sip and eat just behind the art gallery. They have plenty of books to pore over while eating your food/drink. If you have any questions about the items on the menu, the person working the register at the tea shop is very knowledgeable! Usagi is the perfect pit stop if you've just finished crossing the Brooklyn Bridge!",
    "date": "2023-04-04"
},
{
    "author": "Jasna R.",
    "rating": 4.0,
    "description": "I've gone here a few times for lunch. I love their hojicha and combo soba. Their gyudon has a bit too much rice for me, and that's saying something as a rice lover. Their Inari sushi is pretty good and comes with some fresh and pickled vegetables. Similar with their onigiri (I had the spicy tuna). My friend had their chicken curry and didn't like it as much as the gyudon,  but I've yet to try it myself. Eager to try other drinks and food next time.The environment is very nice, cute, fun, and quiet. The staff are sweet and hospitable. Be sure to ask for a receipt upfront if you need it; the default is to not give one, which is fine for many people these days--but not all!",
    "date": "2022-11-14"
},
{
    "author": "Taylor W.",
    "rating": 3.0,
    "description": "They have an extremely poor system in giving out their food orders. I placed an order on the QR code that doesn't require an app and it says to wait until they call your name. My food was probably ready for a good 40 minutes but no one said anything. Went up to the register and the lady told me it was ready on the app so...where was it? It was hiding on the side behind the counter. I never received a ready notification anywhere. Anyways, that system is pretty shitty as they'll sometimes call names out and then won't. As such, food was mediocre. Gyudon was about $18 after tax. It had a lot of rice and onion and was just overall really mushy. Might have been the fact that it was just sitting there but I grade things as I receive them. The matcha latte was ok but cost me about $8 for the smallest serving which is fine depending on the quality of matcha used. I heard their coffee is supposedly good but never got the chance to try it. Good work space with wifi and environment but gets extremely busy during lunch. Not sure if I would come by here again in the future since it seems to be a hot mess.",
    "date": "2022-09-29"
},
{
    "author": "Loanne N.",
    "rating": 4.0,
    "description": "A great spot to do work or spend an afternoon in! The location around the area has some cute spots but is mostly under constructions as of now, but doesn't impact the ambiance of this place. There are many outlets located around the area along with couches and desks to work. It's fairly quiet in the weekday mornings so you can definitely come by and take calls, but it does pick up in the afternoon and gets quite busy. The coffee is decent- matcha is not the best in my opinion. Would definitely get the food here though as it tastes super homemade and authentic. The noodles and the bulgogi both make for a great afternoon lunch. Would definitely come back to do work or just catch up with someone!",
    "date": "2022-10-04"
},
{
    "author": "Suzanne G.",
    "rating": 5.0,
    "description": "Mike and Rebecca are so nice - awesome service! And the cookies are the best in town.",
    "date": "2023-03-13"
},
{
    "author": "Samantha D.",
    "rating": 4.0,
    "description": "After hearing so many good things about the chocolate chip cookie, I had to come and try it. I loved that the cookie had what I believe to be macadamia nuts inside. It provided such a nice textural contrast. The outside of the cookie was crispy, and the inside was somewhat gooey and chewy. The chocolate was semisolid. It was a little bit too sweet for my preferences though, but it's a perfect pairing with a coffee or tea. The matcha latte was okay. It wasn't the strongest matcha I've had, but the taste of the matcha was there. There was ample amount of foam, and the temperature was perfect. There was some unwhisked matcha at the bottom of the cup though.It's not the best cookie I've had, but it is pretty good. I'm glad I decided to stop by to try it at least once.",
    "date": "2023-03-12"
},
{
    "author": "Yvonne P.",
    "rating": 5.0,
    "description": "Omg! I love discovering new breakfast/brunch locations. I invited my work crew to stop before we headed to work and five of them all enjoyed every dish we ordered. I highly recommend their Almond Croissant and Nectarines Waffle and both were really good and amazing! I was almost tempted to stop through just to pick up another order of Pistachio Croissant for breakfast the next day! Everything was so delicious and the service was great.",
    "date": "2023-02-16"
},
{
    "author": "Christina W.",
    "rating": 5.0,
    "description": "I love Mamans! From their pastries to beverages to lunch, it's one of my favorite spots in the city. If you're picking up an order during lunch time, I highly recommend placing an order online ahead of time because the line gets crazy. It's lovely in the summer time since they have some outdoor seating. The back garden area is a bit small, but still a nice place to eat. I could never leave here without a cookie! I'll have to buy one of their cookbooks one day so I can make some of their recipes. It's a bit high in terms of price pint, but overall, it's a great spot for coffee or pastries.",
    "date": "2023-02-09"
},
{
    "author": "Patricia T.",
    "rating": 5.0,
    "description": "My friends and I really enjoyed the coffee tasting journey here . We had AL- KHANSHALI III JA'ADI DRY ANAEROBIC from Yemen ; CARMEN ESTATE GESHA CARLOS AGUILERA from Panama , and PASSION FRUIT MACERATION from Colombia Every one of them has an enjoyable balance of flavours where sweet, bitter and acidic notes all work pleasantly together.Our Baristas Peace and John are so knowledgeable, friendly , attentive, and detail -oriented. It is because of the talented and friendly baristas , Peace and John , who work hard to create our coffee by pouring their skills, passions, and talents into our cup that make our Journey so pleasant.  They even teach us how to pair pastries with our coffee! Coffee project at LIC has a cozy and intimate and yet relaxing and casual social atmosphere where people reading books/ magazines, chatting with friends , browsing websites/ internet . Our journey ends with a surprise-- the Sakura blossom latte ( hot and cold) .",
    "date": "2023-04-12"
},
{
    "author": "Selena Y.",
    "rating": 4.0,
    "description": "Lovely little coffee shop where I enjoyed sitting outdoors and catching up with a friend.My seasonal Sakura Blossom Latte was beautifully presented with the layers of pink in it, but it definitely needed a good stir - my first sip was intensely syrupy. Once it was mixed through though, it had a nice floral and slight cherry flavor to it.My friend ordered the Deconstructed Latte, which had such a fun presentation. The downside: she said she could pretty much predict what the flavors were before drinking it, and it felt like the deconstruction wasn't as \"special\" as she had hoped. The presentation was more for the photo op than anything else, and it might be better to just get a regular latte next time.",
    "date": "2023-04-11"
},
{
    "author": "Neha G.",
    "rating": 4.0,
    "description": "After seeing photos of the deconstructed latte, I thought I have to visit this place! So I stopped by late afternoon and luckily was able to secure a table. The place is small with just three tables for couples, a bench for two, and a small barstool seating. Those that come, do like to linger and take it slow with their drinks. The deconstructed latte was all about presentation. You get three glasses including a shot of espresso, some milk ($1 extra for oat milk), and then a latte. Also comes with sparkling water as a palate cleanser and wafer/pizzelle. The espresso is strong & bitter, milk is basic, and the latte was decent. I had the impression this comes deconstructed but I'd be mixing items together to make the latte. Instead, it's just 3 items giving you the chance to taste them separately. (Approx $12-14) While ascetically pleasing to the eye, I'd probably just order a latte in a mug instead for under $6.They sell various pastries (including a few vegan options & some gluten free) as well as some breakfast like food items (toast). You can also purchase their coffee and some merch. There is a water jug near the front to refill your glass. I managed to find a power plugin there to charge my phone. No restrooms.",
    "date": "2023-01-20"
},
{
    "author": "Andreas K.",
    "rating": 4.0,
    "description": "The coffee shops in NYC are fortunately uncountable and hence, there is almost everywhere a place to get a great coffee. All or many of them provide wonderful variations of coffee. And while they may not beat each other, their real win is not what they are but what they are not. I.e. it is great to have so many alternatives to Starbucks, and CBTL, and Peet's etc.",
    "date": "2023-03-06"
},
{
    "author": "Liz L.",
    "rating": 5.0,
    "description": "This Gong Gan (space) was full of fun and artistic pieces: the decor, tablewares, food and drinks with a trendy combination of texture and color.",
    "date": "2023-04-06"
},
{
    "author": "G K.",
    "rating": 5.0,
    "description": "Really love this place! I've gone a couple of times now... I'm a huge dessert fiend but often find that they're so sweet I can't take more than a few bites no matter how good (maybe I'm getting old!) but I really appreciate the desserts here are not overpowering and they're delicious!! Just my style- didn't leave a CRUMB behind! Plus who doesn't love the portion sizes! The drinks: too pretty! As an added plus I'm giving up caffeine so it's really nice to come to a cafe with so many options that aren't coffee based! The space is also super cute- every corner is a photo op waiting to happen! If you're in Flushing you must check it out!!!",
    "date": "2023-03-24"
},
{
    "author": "Nikky S.",
    "rating": 5.0,
    "description": "First time here ...this place was amazinggg!! I mean the place is beautiful. It's so cool the vibes were amazing , the bathroom was beautiful and the cream latte was amazing ! I'm not a coffee person but that latte definitely hit! Not to mention the staff was super nice ! Definitely a new gem in flushing !",
    "date": "2023-03-09"
},
{
    "author": "Mari T.",
    "rating": 4.0,
    "description": "It is a nice cozy cafe. It is about two stores from Tangram Mall. When I went there in early April, it was very busy. Everyone at the station was working non-stop including the cashier. I assumed they have many orders since they have been trending on social media. I only knew about this place from my friend who sent me a video from IG. So I decided to check it out. The customers and I waited in line for about 5 to 8 minutes before someone took our orders. I ordered the Strawberry Cruffin and Strawberry Latte. The pastry was light. It wasn't sweet. I ordered the strawberry cruffin. The strawberry latte was okay. I thought it might have a hint of caffeine, but I didn't taste any caffeine. It was very foaming with fresh strawberries. It didn't wow me, but it was refreshing. I did enjoy it. I will come back and try the other sweets on the menu.",
    "date": "2023-04-23"
},
{
    "author": "Vincent L.",
    "rating": 5.0,
    "description": "If I owned my own bookstore and/or café, I'd want it to be as cool as this one. Book Club is open almost all day long - from morning till midnight, 7 days a week - serving not only as a bookstore, but also as a laptop-friendly café during the day, and a laptop-free lounge, music, and events space in the evenings. Indeed, when I stopped by recently, plenty of folks were in on the secret, typing away at their laptops in the bar or in a cozier living room-like area in the rear. Laptop loiterers should note that there is a 90-minute time limit during the day, subject to a purchase. There's not only coffee, but also beer, wine, and snacks here. The outdoor parklet is also a good space to meet and chat with folks over a coffee or beer, although, this being ultra-dense New York, you should not expect any privacy when it comes to your conversation. I stopped by recently to rehydrate (over a beer, of course) while on a walk through the neighborhood and, after overhearing sensitive HR information from one party and TMI relationship details from another, promptly put on my headphones as I typed away more Yelp reviews on my phone.",
    "date": "2023-04-20"
},
{
    "author": "Athena A.",
    "rating": 4.0,
    "description": "Nestled in the heart of winter, there's a spot so cozy that it feels like a charming bar bookstore. As you settle into the warmth of the surroundings, you can't help but feel a sense of joy and contentment. Although, it could use a little more attention to detail, like the addition of a fake fire to enhance the ambiance.As you wander towards the bathrooms, you'll notice that they are gender-free, but that can be a bit confusing. The mirrors are positioned in such a way that you may catch the eyes of passersby, which can create an awkward atmosphere. It's not comfortable to be alone in there with a man present.Despite the slight discomfort, the experience is made even better by the delicious coffee, especially the mocha. Even though it's not the ideal spot for work, many people can still be found at the coffee bar typing away on their computers, sporting the quintessential New Yorker vibes. Books are very unique and offer a wide variety of international writers and hard to find books.",
    "date": "2023-04-17"
},
{
    "author": "Qween D.",
    "rating": 5.0,
    "description": "The Book Club is a unique cozy bookstore that sells coffee and wine. The store is located on the lower east side of Manhattan and is near many restaurants and local hot spots such as Tompkins Square Park and the iconic Jewish deli, Katz Delicatessen. The coffee is very rich and the wine is tasty as well. Overall the store is a great place for booklovers and students to come and work, read, and potentially network. What brought me to the store was the vibe. I was looking for a place to study when I stumbled across this jewel. I ordered a cup of coffee, which was delicious. I just wish they had more options. I took a seat in a very comfortable brown leather chair, which reminded me of my grandfather's chair. The walls were covered with books, placed on heavy oak wood bookshelves and the store felt almost whimsical and very chill. I was able to complete much of my assignments that day and left the store feeling refreshed.",
    "date": "2023-04-17"
},
{
    "author": "Meghna S.",
    "rating": 4.0,
    "description": "Loved this bar. We planned our friend's farewell here coz she loves books and this was everything we hoped for. Friendly staff, well priced drinks and great variety of books to read/ buy. It has a beautiful backyard seating where you can read your book or chill with a drink. We did feel a bit guilty about being a noisy group but in our defense it was Saturday evening. Sadly I forgot to take pics but I highly recommend this pretty place if you happen to be in the neighborhood.",
    "date": "2023-04-23"
},
{
    "author": "Samantha R.",
    "rating": 5.0,
    "description": "I've come here numerous times for dinner, happy hour, late night, and now for brunch. This place is an absolute gem. Decided to try the cheesy burger, and it was cooked exactly to my liking. The truffle fries with the garlic aioli is just super tasty and addicting. That aioli is what makes those fries soooo good. Also had the avocado smash with a poached egg and that was quite tasty, bread was toasted but wasn't hard which was refreshing. And for drinks, tried the Paloma (I forgot the name) but it's on their cocktail menu and that was VERY STRONG & also tasty. Restrooms are gender neutral, music isn't so loud and the ambiance itself is just chill and relaxed. Will continue to come to this place again and again. Try their signature Hole'd fashioned and definitely have the espresso martini, thank me later",
    "date": "2022-12-20"
},
{
    "author": "Kaya E.",
    "rating": 4.0,
    "description": "Popped into Hole in Wall after there was absolutely no more space inside at Sauced right up the street. It actually worked better for my friend and I to come to Hole in the Wall because it was wayy nicer and not as sweaty lol. When we arrived on a Friday evening we were quickly seated. The ambience was really nice in here with the bar lit up and live performers singing some of my favorite Erykah Badu songs. What I will say is that I wished that they had a coat rack or something because the tables were so close and my coat was so big that I had to keep it in my lap the whole night. Our food and drinks were good nothing too special. I enjoyed my espresso martini and the fries/brussel sprouts that we shared. I appreciate how patient they were with my friend and I. We hadn't seen each other in awhile so our quick dinner turned into 3 hours of talking and we were the last ones in there. They were kind and didn't rush us out or make us feel awkward.Thanks Hole in the Wall",
    "date": "2023-04-22"
},
{
    "author": "Sara Y.",
    "rating": 3.0,
    "description": "1st time, we loved this Australian Restaurant! The reasons we took off 2stars, the Music was Too loud we needed to talk to each other very loud all the time....Yes! We got very tired! I wonder why they put the Music So loud....it's not a dance club. We also needed to change the Waiters 2 times, They made mistakes brought a wrong Tea, charged extra food, (it supposed to be actually included) since the music was loud, we needed to tell the server by hands but he didn't seem understand at all...  :( But we def come back here, we were happily there, after we changed The waiter, everything went well. A good atmosphere, good food! 292 Bedford ave bk NY",
    "date": "2022-12-19"
},
{
    "author": "Wing C.",
    "rating": 4.0,
    "description": "this place is now sushi on me - brooklyn location!!!yelp, please change it",
    "date": "2023-04-19"
},
{
    "author": "Batool H.",
    "rating": 5.0,
    "description": "% Arabica's first location in the US! I first had this coffee spot in Dubai and fell in love ever since! Their coffee is absolutely delicious, all the employees are very nice, and they roast their beans fresh! My favorite is their iced spanish latte - so good! It's a bit sweet so just be prepared. They're also got pastries - a great kouign amann!The inside is very aesthetic with bar seating against the windows and island counters in the middle for standing and enjoying your cup. They've also got tables outside.It's a little walk to get to from the train station but well worth it, especially for the beautiful view of the Brooklyn Bridge! I've been here multiple times just to grab their whole beans - they make great gifts for people visiting! Would definitely recommend this to anyone visiting New York, especially since they don't have another US location! (as of yet, there's an LA location coming soon!)",
    "date": "2023-04-16"
},
{
    "author": "Love K.",
    "rating": 5.0,
    "description": "I am shocked that this is location is the only one in the US. I've seen the logo online and finally made my way over to grab a latte. There was a line out the door around 3pm on Sunday but the folks in front of us slowly kept leaving. Once we made it to the register, the gal told us there'd be a 30 minute wait. It seems like they took on more orders (possibly online too) than they could push out.Well, that didn't stop me. I placed an order for a matcha latte and hub ordered the Kyoto latte. We went out for a quick 20 minute walk and drinks looked to have been ready for a while.Hands down, the most thick, rich, and luxurious tasting matcha I have ever tasted. I requested it to be sweetened which she mentioned there would be simple syrup to add at the counter. However, upon first sip, it didn't require it. It was lightly sweetened and perfect! I hope to make another pit stop in Brooklyn to grab one more cup. Cheers!",
    "date": "2023-03-28"
},
{
    "author": "Jenni W.",
    "rating": 5.0,
    "description": "I've been on the constant search for a pastry place that has kouign amanns in NY, and have had difficulty finding any. However, I was happy to find this coffee shop after looking online for places that sold kouign amanns! Not only do they have good kouign amanns (especially if you're able to reheat them up in the oven for a few minutes for ultimate flakiness), but their other pastries are pretty delicious and so is their coffee. I am a big fan of their Spanish and Kyoto latte. It has just the subtlest hint of sweetness to pair with the overall boldness of the coffee. The milk The overall aesthetic of the coffee shop is also pretty awesome! Overall very modern and chic. I will say though, sometimes the line does get super long so if it's a weekend morning, I would try to go earlier if you can. Seats are also limited, but if you're not able to snag a seat, you always have the option of just walking outside and enjoying your coffee and/or pastry with a beautiful view of the Manhattan skyline!",
    "date": "2023-03-24"
},
{
    "author": "Ellie C.",
    "rating": 4.0,
    "description": "Located in the downtown Brooklyn near the waterfront, this Kyoto-originated coffee shop is definitely worth a visit! I love the whole aesthetics of their store design and both service and coffees are great! If you're new to the neighborhood, take a walk to Dumbo and the waterfront for one of the best skyline views of Manhattan!",
    "date": "2023-03-19"
}
]